name: "Res_101"
force_backward: true
layer { top: 'data' top: 'label' name: 'loaddata'       type: 'HDF5Data'  hdf5_data_param { source: 'train.txt' batch_size: 1 shuffle: true} }
#layer { top: 'data' top: 'label' name: 'loaddata'       type: 'HDF5Data'  hdf5_data_param { source: 'val.txt' batch_size: 1 } }

#layer {
#  name: "input"
#  type: "Input"
#  top: "data"
#  input_param { shape { dim: 1 dim: 4 dim: 1024 dim: 1024} }
#}


###################### resolution 1 #####################
layer {  bottom: "data"    top: "conv0a" name: "conv0a"  type: "Convolution"    convolution_param {    num_output: 64    pad: 1    kernel_size: 3  bias_term: false  stride: 1 weight_filler {  type: "msra" } bias_filler {type: "constant" value: 0}}}
layer {  bottom: "conv0a"  top: "conv0a" name: "bn_conv0a"  type: "BatchNorm"    param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {  bottom: "conv0a"  top: "conv0a" name: "scale_conv0a"  type: "Scale"    scale_param {    bias_term: true  }}
layer {  bottom: "conv0a"  top: "conv0a" name: "conv0a_relu"  type: "ReLU"  }#(64X768X768)

layer {  bottom: "conv0a"  top: "conv0b" name: "conv0b"  type: "Convolution"    convolution_param {num_output: 64    pad: 1    kernel_size: 3  bias_term: false  stride: 1  weight_filler {  type: "msra"  }  bias_filler {type: "constant" value: 0}}}
layer {  bottom: "conv0b"  top: "conv0b" name: "bn_conv0b"  type: "BatchNorm"    param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {  bottom: "conv0b"  top: "conv0b" name: "scale_conv0b"  type: "Scale"    scale_param {    bias_term: true  }}
layer {  bottom: "conv0b"  top: "conv0b" name: "conv0b_relu"  type: "ReLU"  }#(64X768X768)

layer {  bottom: "conv0b"  top: "conv0c" name: "conv0c"  type: "Convolution"    convolution_param {num_output: 64    pad: 1  kernel_size: 3  bias_term: false  stride: 1  weight_filler {   type: "msra" }  bias_filler { type: "constant" value: 0}}}
layer {  bottom: "conv0c"  top: "conv0c" name: "bn_conv0c"  type: "BatchNorm"    param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {  bottom: "conv0c"  top: "conv0c" name: "scale_conv0c"  type: "Scale"    scale_param {    bias_term: true  }}
layer {  bottom: "conv0c"  top: "conv0c" name: "conv0c_relu"  type: "ReLU"  }#(64X768X768)

################################################################################################## Transition Down ###########################################################################################################################

layer {  bottom: "conv0c"    top: "conv1a" name: "conv1a"  type: "Convolution"    convolution_param {num_output: 64    pad: 1    kernel_size: 3  bias_term: false  stride: 2 weight_filler {  type: "msra" } bias_filler {type: "constant" value: 0}}}
layer {  bottom: "conv1a"  top: "conv1a" name: "bn_conv1a"  type: "BatchNorm"    param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {  bottom: "conv1a"  top: "conv1a" name: "scale_conv1a"  type: "Scale"    scale_param {    bias_term: true  }}
layer {  bottom: "conv1a"  top: "conv1a" name: "conv1a_relu"  type: "ReLU"  }#(64X768X768)

layer {  bottom: "conv1a"  top: "conv1b" name: "conv1b"  type: "Convolution"    convolution_param {num_output: 64    pad: 1    kernel_size: 3  bias_term: false  stride: 1  weight_filler {  type: "msra"  }  bias_filler {type: "constant" value: 0}}}
layer {  bottom: "conv1b"  top: "conv1b" name: "bn_conv1b"  type: "BatchNorm"    param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {  bottom: "conv1b"  top: "conv1b" name: "scale_conv1b"  type: "Scale"    scale_param {    bias_term: true  }}
layer {  bottom: "conv1b"  top: "conv1b" name: "conv1b_relu"  type: "ReLU"  }#(64X768X768)

layer {  bottom: "conv1b"  top: "conv1c" name: "conv1c"  type: "Convolution"    convolution_param {num_output: 64    pad: 1  kernel_size: 3  bias_term: false  stride: 1  weight_filler {   type: "msra" }  bias_filler { type: "constant" value: 0}}}
layer {  bottom: "conv1c"  top: "conv1c" name: "bn_conv1c"  type: "BatchNorm"    param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {  bottom: "conv1c"  top: "conv1c" name: "scale_conv1c"  type: "Scale"    scale_param {    bias_term: true  }}
layer {  bottom: "conv1c"  top: "conv1c" name: "conv1c_relu"  type: "ReLU"  }#(64X768X768)

################################################################################################## Transition Down ###########################################################################################################################

layer {        bottom: "conv1c"        top: "pool1"        name: "pool1"        type: "Pooling"        pooling_param {                kernel_size: 3                stride: 2                pool: MAX        }}

############################################################################################### No Transition Down ###########################################################################################################################

layer {        bottom: "pool1"        top: "res2a_branch1"        name: "res2a_branch1"        type: "Convolution" convolution_param{                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2a_branch1"        top: "res2a_branch1"        name: "bn2a_branch1"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2a_branch1"        top: "res2a_branch1"        name: "scale2a_branch1"        type: "Scale"        scale_param {                bias_term: true        }}

#################################################################################################### Res Block 1 #############################################################################################################################

layer {        bottom: "pool1"        top: "res2a_branch2a"        name: "res2a_branch2a"        type: "Convolution"               convolution_param {                num_output: 64                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2a_branch2a"        top: "res2a_branch2a"        name: "bn2a_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2a_branch2a"        top: "res2a_branch2a"        name: "scale2a_branch2a"        type: "Scale"        scale_param {                bias_term: true        }   }
layer {        top: "res2a_branch2a"        bottom: "res2a_branch2a"        name: "res2a_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res2a_branch2a"        top: "res2a_branch2b"        name: "res2a_branch2b"        type: "Convolution"               convolution_param {                num_output: 64                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res2a_branch2b"        top: "res2a_branch2b"        name: "bn2a_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2a_branch2b"        top: "res2a_branch2b"        name: "scale2a_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res2a_branch2b"        bottom: "res2a_branch2b"        name: "res2a_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res2a_branch2b"        top: "res2a_branch2c"        name: "res2a_branch2c"        type: "Convolution"               convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2a_branch2c"        top: "res2a_branch2c"        name: "bn2a_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2a_branch2c"        top: "res2a_branch2c"        name: "scale2a_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res2a_branch1"        bottom: "res2a_branch2c"        top: "res2a"        name: "res2a"        type: "Eltwise"}
layer {        bottom: "res2a"        top: "res2a"        name: "res2a_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res2a"        top: "res2b_branch2a"        name: "res2b_branch2a"        type: "Convolution"              convolution_param {                num_output: 64                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2b_branch2a"        top: "res2b_branch2a"        name: "bn2b_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2b_branch2a"        top: "res2b_branch2a"        name: "scale2b_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res2b_branch2a"        bottom: "res2b_branch2a"        name: "res2b_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res2b_branch2a"        top: "res2b_branch2b"        name: "res2b_branch2b"        type: "Convolution"               convolution_param {                num_output: 64                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res2b_branch2b"        top: "res2b_branch2b"        name: "bn2b_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2b_branch2b"        top: "res2b_branch2b"        name: "scale2b_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res2b_branch2b"        bottom: "res2b_branch2b"        name: "res2b_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res2b_branch2b"        top: "res2b_branch2c"        name: "res2b_branch2c"        type: "Convolution"               convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2b_branch2c"        top: "res2b_branch2c"        name: "bn2b_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2b_branch2c"        top: "res2b_branch2c"        name: "scale2b_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res2a"        bottom: "res2b_branch2c"        top: "res2b"        name: "res2b"        type: "Eltwise"}
layer {        bottom: "res2b"        top: "res2b"        name: "res2b_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res2b"        top: "res2c_branch2a"        name: "res2c_branch2a"        type: "Convolution"               convolution_param {                num_output: 64                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2c_branch2a"        top: "res2c_branch2a"        name: "bn2c_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2c_branch2a"        top: "res2c_branch2a"        name: "scale2c_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res2c_branch2a"        bottom: "res2c_branch2a"        name: "res2c_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res2c_branch2a"        top: "res2c_branch2b"        name: "res2c_branch2b"        type: "Convolution"               convolution_param {                num_output: 64                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res2c_branch2b"        top: "res2c_branch2b"        name: "bn2c_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2c_branch2b"        top: "res2c_branch2b"        name: "scale2c_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res2c_branch2b"        bottom: "res2c_branch2b"        name: "res2c_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res2c_branch2b"        top: "res2c_branch2c"        name: "res2c_branch2c"        type: "Convolution"           convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res2c_branch2c"        top: "res2c_branch2c"        name: "bn2c_branch2c"        type: "BatchNorm"       param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res2c_branch2c"        top: "res2c_branch2c"        name: "scale2c_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res2b"        bottom: "res2c_branch2c"        top: "res2c"        name: "res2c"        type: "Eltwise"}
layer {        bottom: "res2c"        top: "res2c"        name: "res2c_relu"        type: "ReLU"}

################################################################################################### Transition Down  ##########################################################################################################################

layer {        bottom: "res2c"        top: "res3a_branch1"        name: "res3a_branch1"        type: "Convolution"            convolution_param{                num_output: 512                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 2                bias_term: false        }}
layer {        bottom: "res3a_branch1"        top: "res3a_branch1"        name: "bn3a_branch1"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3a_branch1"        top: "res3a_branch1"        name: "scale3a_branch1"        type: "Scale"        scale_param {                bias_term: true        }        }

################################################################################################# Res Block 2 #################################################################################################################################

layer {        bottom: "res2c"        top: "res3a_branch2a"        name: "res3a_branch2a"        type: "Convolution"             convolution_param {                num_output: 128                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 2                bias_term: false        }}
layer {        bottom: "res3a_branch2a"        top: "res3a_branch2a"        name: "bn3a_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3a_branch2a"        top: "res3a_branch2a"        name: "scale3a_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3a_branch2a"        bottom: "res3a_branch2a"        name: "res3a_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res3a_branch2a"        top: "res3a_branch2b"        name: "res3a_branch2b"        type: "Convolution"              convolution_param {                num_output: 128                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res3a_branch2b"        top: "res3a_branch2b"        name: "bn3a_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3a_branch2b"        top: "res3a_branch2b"        name: "scale3a_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3a_branch2b"        bottom: "res3a_branch2b"        name: "res3a_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res3a_branch2b"        top: "res3a_branch2c"        name: "res3a_branch2c"        type: "Convolution"            convolution_param {                num_output: 512                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3a_branch2c"        top: "res3a_branch2c"        name: "bn3a_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3a_branch2c"        top: "res3a_branch2c"        name: "scale3a_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res3a_branch1"        bottom: "res3a_branch2c"        top: "res3a"        name: "res3a"        type: "Eltwise"}
layer {        bottom: "res3a"        top: "res3a"        name: "res3a_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res3a"        top: "res3b1_branch2a"        name: "res3b1_branch2a"        type: "Convolution"             convolution_param {                num_output: 128                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3b1_branch2a"        top: "res3b1_branch2a"        name: "bn3b1_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b1_branch2a"        top: "res3b1_branch2a"        name: "scale3b1_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3b1_branch2a"        bottom: "res3b1_branch2a"        name: "res3b1_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res3b1_branch2a"        top: "res3b1_branch2b"        name: "res3b1_branch2b"        type: "Convolution"            convolution_param {                num_output: 128                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res3b1_branch2b"        top: "res3b1_branch2b"        name: "bn3b1_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b1_branch2b"        top: "res3b1_branch2b"        name: "scale3b1_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3b1_branch2b"        bottom: "res3b1_branch2b"        name: "res3b1_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res3b1_branch2b"        top: "res3b1_branch2c"        name: "res3b1_branch2c"        type: "Convolution"             convolution_param {                num_output: 512                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3b1_branch2c"        top: "res3b1_branch2c"        name: "bn3b1_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b1_branch2c"        top: "res3b1_branch2c"        name: "scale3b1_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res3a"        bottom: "res3b1_branch2c"        top: "res3b1"        name: "res3b1"        type: "Eltwise"}
layer {        bottom: "res3b1"        top: "res3b1"        name: "res3b1_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res3b1"        top: "res3b2_branch2a"        name: "res3b2_branch2a"        type: "Convolution"            convolution_param {                num_output: 128                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3b2_branch2a"        top: "res3b2_branch2a"        name: "bn3b2_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b2_branch2a"        top: "res3b2_branch2a"        name: "scale3b2_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3b2_branch2a"        bottom: "res3b2_branch2a"        name: "res3b2_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res3b2_branch2a"        top: "res3b2_branch2b"        name: "res3b2_branch2b"        type: "Convolution"           convolution_param {                num_output: 128                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res3b2_branch2b"        top: "res3b2_branch2b"        name: "bn3b2_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b2_branch2b"        top: "res3b2_branch2b"        name: "scale3b2_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3b2_branch2b"        bottom: "res3b2_branch2b"        name: "res3b2_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res3b2_branch2b"        top: "res3b2_branch2c"        name: "res3b2_branch2c"        type: "Convolution"            convolution_param {                num_output: 512                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3b2_branch2c"        top: "res3b2_branch2c"        name: "bn3b2_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b2_branch2c"        top: "res3b2_branch2c"        name: "scale3b2_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res3b1"        bottom: "res3b2_branch2c"        top: "res3b2"        name: "res3b2"        type: "Eltwise"}
layer {        bottom: "res3b2"        top: "res3b2"        name: "res3b2_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res3b2"        top: "res3b3_branch2a"        name: "res3b3_branch2a"        type: "Convolution"            convolution_param {                num_output: 128                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3b3_branch2a"        top: "res3b3_branch2a"        name: "bn3b3_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b3_branch2a"        top: "res3b3_branch2a"        name: "scale3b3_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3b3_branch2a"        bottom: "res3b3_branch2a"        name: "res3b3_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res3b3_branch2a"        top: "res3b3_branch2b"        name: "res3b3_branch2b"        type: "Convolution"            convolution_param {                num_output: 128                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                stride: 1                bias_term: false        }}
layer {        bottom: "res3b3_branch2b"        top: "res3b3_branch2b"        name: "bn3b3_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b3_branch2b"        top: "res3b3_branch2b"        name: "scale3b3_branch2b"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res3b3_branch2b"        bottom: "res3b3_branch2b"        name: "res3b3_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res3b3_branch2b"        top: "res3b3_branch2c"        name: "res3b3_branch2c"        type: "Convolution"            convolution_param {                num_output: 512                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res3b3_branch2c"        top: "res3b3_branch2c"        name: "bn3b3_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res3b3_branch2c"        top: "res3b3_branch2c"        name: "scale3b3_branch2c"        type: "Scale"        scale_param {                bias_term: true        }       }
layer {        bottom: "res3b2"        bottom: "res3b3_branch2c"        top: "res3b3"        name: "res3b3"        type: "Eltwise"}
layer {        bottom: "res3b3"        top: "res3b3"        name: "res3b3_relu"        type: "ReLU"}

################################################################################################### Transition Down  ##########################################################################################################################

layer {        bottom: "res3b3"        top: "res4a_branch1"        name: "res4a_branch1"        type: "Convolution"          convolution_param{                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 2                bias_term: false        }}
layer {        bottom: "res4a_branch1"        top: "res4a_branch1"        name: "bn4a_branch1"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4a_branch1"        top: "res4a_branch1"        name: "scale4a_branch1"        type: "Scale"        scale_param {                bias_term: true        }        }

################################################################################################# Res Block 3 #################################################################################################################################

layer {        bottom: "res3b3"        top: "res4a_branch2a"        name: "res4a_branch2a"        type: "Convolution"          convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 2                bias_term: false        }}
layer {        bottom: "res4a_branch2a"        top: "res4a_branch2a"        name: "bn4a_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4a_branch2a"        top: "res4a_branch2a"        name: "scale4a_branch2a"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        top: "res4a_branch2a"        bottom: "res4a_branch2a"        name: "res4a_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res4a_branch2a"        top: "res4a_branch2b"        name: "res4a_branch2b"        type: "Convolution"             convolution_param {                num_output: 256                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                         stride: 1                bias_term: false        }}
layer {        bottom: "res4a_branch2b"        top: "res4a_branch2b"        name: "bn4a_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4a_branch2b"        top: "res4a_branch2b"        name: "scale4a_branch2b"        type: "Scale"        scale_param {                bias_term: true        }       }
layer {        top: "res4a_branch2b"        bottom: "res4a_branch2b"        name: "res4a_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res4a_branch2b"        top: "res4a_branch2c"        name: "res4a_branch2c"        type: "Convolution"             convolution_param {                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4a_branch2c"        top: "res4a_branch2c"        name: "bn4a_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4a_branch2c"        top: "res4a_branch2c"        name: "scale4a_branch2c"        type: "Scale"        scale_param {                bias_term: true        }        }
layer {        bottom: "res4a_branch1"        bottom: "res4a_branch2c"        top: "res4a"        name: "res4a"        type: "Eltwise"}
layer {        bottom: "res4a"        top: "res4a"        name: "res4a_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res4a"        top: "res4b1_branch2a"        name: "res4b1_branch2a"        type: "Convolution"          convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b1_branch2a"        top: "res4b1_branch2a"        name: "bn4b1_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b1_branch2a"        top: "res4b1_branch2a"        name: "scale4b1_branch2a"        type: "Scale"        scale_param {                bias_term: true        }       }
layer {        top: "res4b1_branch2a"        bottom: "res4b1_branch2a"        name: "res4b1_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res4b1_branch2a"        top: "res4b1_branch2b"        name: "res4b1_branch2b"        type: "Convolution"           convolution_param {                num_output: 256                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                               stride: 1                bias_term: false        }}
layer {        bottom: "res4b1_branch2b"        top: "res4b1_branch2b"        name: "bn4b1_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b1_branch2b"        top: "res4b1_branch2b"        name: "scale4b1_branch2b"        type: "Scale"        scale_param {                bias_term: true        }     }
layer {        top: "res4b1_branch2b"        bottom: "res4b1_branch2b"        name: "res4b1_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res4b1_branch2b"        top: "res4b1_branch2c"        name: "res4b1_branch2c"        type: "Convolution"            convolution_param {                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b1_branch2c"        top: "res4b1_branch2c"        name: "bn4b1_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b1_branch2c"        top: "res4b1_branch2c"        name: "scale4b1_branch2c"        type: "Scale"        scale_param {                bias_term: true        }      }
layer {        bottom: "res4a"        bottom: "res4b1_branch2c"        top: "res4b1"        name: "res4b1"        type: "Eltwise"}
layer {        bottom: "res4b1"        top: "res4b1"        name: "res4b1_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res4b1"        top: "res4b2_branch2a"        name: "res4b2_branch2a"        type: "Convolution"            convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b2_branch2a"        top: "res4b2_branch2a"        name: "bn4b2_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b2_branch2a"        top: "res4b2_branch2a"        name: "scale4b2_branch2a"        type: "Scale"        scale_param {                bias_term: true        }      }
layer {        top: "res4b2_branch2a"        bottom: "res4b2_branch2a"        name: "res4b2_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res4b2_branch2a"        top: "res4b2_branch2b"        name: "res4b2_branch2b"        type: "Convolution"            convolution_param {                num_output: 256                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                               stride: 1                bias_term: false        }}
layer {        bottom: "res4b2_branch2b"        top: "res4b2_branch2b"        name: "bn4b2_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b2_branch2b"        top: "res4b2_branch2b"        name: "scale4b2_branch2b"        type: "Scale"        scale_param {                bias_term: true        }    }
layer {        top: "res4b2_branch2b"        bottom: "res4b2_branch2b"        name: "res4b2_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res4b2_branch2b"        top: "res4b2_branch2c"        name: "res4b2_branch2c"        type: "Convolution"          convolution_param {                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b2_branch2c"        top: "res4b2_branch2c"        name: "bn4b2_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b2_branch2c"        top: "res4b2_branch2c"        name: "scale4b2_branch2c"        type: "Scale"        scale_param {                bias_term: true        }     }
layer {        bottom: "res4b1"        bottom: "res4b2_branch2c"        top: "res4b2"        name: "res4b2"        type: "Eltwise"}
layer {        bottom: "res4b2"        top: "res4b2"        name: "res4b2_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res4b2"        top: "res4b3_branch2a"        name: "res4b3_branch2a"        type: "Convolution"          convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b3_branch2a"        top: "res4b3_branch2a"        name: "bn4b3_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b3_branch2a"        top: "res4b3_branch2a"        name: "scale4b3_branch2a"        type: "Scale"        scale_param {                bias_term: true        }     }
layer {        top: "res4b3_branch2a"        bottom: "res4b3_branch2a"        name: "res4b3_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res4b3_branch2a"        top: "res4b3_branch2b"        name: "res4b3_branch2b"        type: "Convolution"           convolution_param {                num_output: 256                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                                stride: 1                bias_term: false        }}
layer {        bottom: "res4b3_branch2b"        top: "res4b3_branch2b"        name: "bn4b3_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b3_branch2b"        top: "res4b3_branch2b"        name: "scale4b3_branch2b"        type: "Scale"        scale_param {                bias_term: true        }    }
layer {        top: "res4b3_branch2b"        bottom: "res4b3_branch2b"        name: "res4b3_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res4b3_branch2b"        top: "res4b3_branch2c"        name: "res4b3_branch2c"        type: "Convolution"            convolution_param {                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b3_branch2c"        top: "res4b3_branch2c"        name: "bn4b3_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b3_branch2c"        top: "res4b3_branch2c"        name: "scale4b3_branch2c"        type: "Scale"        scale_param {                bias_term: true        }   }
layer {        bottom: "res4b2"        bottom: "res4b3_branch2c"        top: "res4b3"        name: "res4b3"        type: "Eltwise"}
layer {        bottom: "res4b3"        top: "res4b3"        name: "res4b3_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res4b3"        top: "res4b4_branch2a"        name: "res4b4_branch2a"        type: "Convolution"          convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b4_branch2a"        top: "res4b4_branch2a"        name: "bn4b4_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b4_branch2a"        top: "res4b4_branch2a"        name: "scale4b4_branch2a"        type: "Scale"        scale_param {                bias_term: true        }    }
layer {        top: "res4b4_branch2a"        bottom: "res4b4_branch2a"        name: "res4b4_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res4b4_branch2a"        top: "res4b4_branch2b"        name: "res4b4_branch2b"        type: "Convolution"          convolution_param {                num_output: 256                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                                stride: 1                bias_term: false        }}
layer {        bottom: "res4b4_branch2b"        top: "res4b4_branch2b"        name: "bn4b4_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b4_branch2b"        top: "res4b4_branch2b"        name: "scale4b4_branch2b"        type: "Scale"        scale_param {                bias_term: true        }  }
layer {        top: "res4b4_branch2b"        bottom: "res4b4_branch2b"        name: "res4b4_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res4b4_branch2b"        top: "res4b4_branch2c"        name: "res4b4_branch2c"        type: "Convolution"           convolution_param {                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b4_branch2c"        top: "res4b4_branch2c"        name: "bn4b4_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b4_branch2c"        top: "res4b4_branch2c"        name: "scale4b4_branch2c"        type: "Scale"        scale_param {                bias_term: true        } }
layer {        bottom: "res4b3"        bottom: "res4b4_branch2c"        top: "res4b4"        name: "res4b4"        type: "Eltwise"}
layer {        bottom: "res4b4"        top: "res4b4"        name: "res4b4_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res4b4"        top: "res4b5_branch2a"        name: "res4b5_branch2a"        type: "Convolution"             convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b5_branch2a"        top: "res4b5_branch2a"        name: "bn4b5_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b5_branch2a"        top: "res4b5_branch2a"        name: "scale4b5_branch2a"        type: "Scale"        scale_param {                bias_term: true        }     }
layer {        top: "res4b5_branch2a"        bottom: "res4b5_branch2a"        name: "res4b5_branch2a_relu"        type: "ReLU"}

layer {        bottom: "res4b5_branch2a"        top: "res4b5_branch2b"        name: "res4b5_branch2b"        type: "Convolution"         convolution_param {                num_output: 256                kernel_size: 3                weight_filler {  type: "msra" } pad: 1                                stride: 1                bias_term: false        }}
layer {        bottom: "res4b5_branch2b"        top: "res4b5_branch2b"        name: "bn4b5_branch2b"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b5_branch2b"        top: "res4b5_branch2b"        name: "scale4b5_branch2b"        type: "Scale"        scale_param {                bias_term: true        }     }
layer {        top: "res4b5_branch2b"        bottom: "res4b5_branch2b"        name: "res4b5_branch2b_relu"        type: "ReLU"}

layer {        bottom: "res4b5_branch2b"        top: "res4b5_branch2c"        name: "res4b5_branch2c"        type: "Convolution"            convolution_param {                num_output: 1024                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b5_branch2c"        top: "res4b5_branch2c"        name: "bn4b5_branch2c"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b5_branch2c"        top: "res4b5_branch2c"        name: "scale4b5_branch2c"        type: "Scale"        scale_param {                bias_term: true        }   }
layer {        bottom: "res4b4"        bottom: "res4b5_branch2c"        top: "res4b5"        name: "res4b5"        type: "Eltwise"}
layer {        bottom: "res4b5"        top: "res4b5"        name: "res4b5_relu"        type: "ReLU"}

############################################################################################################################################################################################################################################

layer {        bottom: "res4b5"        top: "res4b6_branch2a"        name: "res4b6_branch2a"        type: "Convolution"            convolution_param {                num_output: 256                kernel_size: 1                weight_filler {  type: "msra" } pad: 0                stride: 1                bias_term: false        }}
layer {        bottom: "res4b6_branch2a"        top: "res4b6_branch2a"        name: "bn4b6_branch2a"        type: "BatchNorm"        param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }  param {    lr_mult: 0    decay_mult: 0  }}
layer {        bottom: "res4b6_branch2a"        top: "res4b6_branch2a"        name: "scale4b6_branch2a"        type: "Scale"        scale_param {                bias_term: true        }  }
layer {        top: "res4b6_branch2a"        bottom: "res4b6_branch2a"        name: "res4b6_branch2a_relu"        type: "ReLU"}

